In [1]:
import pandas as pd
import numpy as np

In [3]:
from numpy.random import randn
np.random.seed(101)

rand_mat = randn(5,4)

In [4]:
rand_mat

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889]])

In [12]:
df =pd.DataFrame(data=rand_mat,index='A B C D E'.split(),columns = '1 2 3 4'.split())

In [13]:
df

          1         2         3         4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [15]:
mylist = ['1','2']
df[mylist]

          1         2
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

In [48]:
df['5'] = df['1'] +df['2']

In [19]:
df

          1         2         3         4         5
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [24]:
df.drop('5',1,inplace=True)

In [25]:
df

          1         2         3         4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [26]:
df

          1         2         3         4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [28]:
df.drop('E',inplace=True)

In [30]:
df.loc['D']

1    0.188695
2   -0.758872
3   -0.933237
4    0.955057
Name: D, dtype: float64

In [31]:
df.iloc[0]

1    2.706850
2    0.628133
3    0.907969
4    0.503826
Name: A, dtype: float64

In [34]:
df.loc[['A','B'],['1','2']]

          1         2
A  2.706850  0.628133
B  0.651118 -0.319318

In [59]:
df > 0

       1      2      3      4      5
A   True   True   True   True   True
B   True  False  False   True   True
C  False   True   True  False  False
D   True  False  False   True  False

In [56]:
grab = df>0
df[grab]

          1         2         3         4         5
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118       NaN       NaN  0.605965  0.331800
C       NaN  0.740122  0.528813       NaN       NaN
D  0.188695       NaN       NaN  0.955057       NaN

In [40]:
df[df['1'] >0]['1']

A    2.706850
B    0.651118
D    0.188695
Name: 1, dtype: float64

In [69]:
cond1 = df['1'] >0
cond2 = df['3'] <2

In [70]:
df[(cond1) & (cond2)]

          1         2         3         4         5
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177

In [85]:
new_ind ='CA NY WY OR CO'.split()
np.random.seed(101)

rand_mat = randn(5,4)
df =pd.DataFrame(data=rand_mat,index='A B C D E'.split(),columns = '1 2 3 4'.split())

In [86]:
df['States'] = new_ind

In [87]:
df

          1         2         3         4 States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [88]:
df.set_index('States',inplace=True)

In [89]:
df

               1         2         3         4
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [90]:
ser_w = df['1'] >0

In [91]:
sum(ser_w)

4

In [92]:
len(ser_w)

5